@ascopes Below is my config:



```terraform
resource "aws_iam_role" "iam_for_lambda" {
  name = substr("lambda_${var.name}_${var.env}_${var.region}", 0, 64)

  assume_role_policy = <<EOF
{
  "Version": "2012-10-17",
  "Statement": [
    {
      "Action": "sts:AssumeRole",
      "Principal": {
        "Service": "lambda.amazonaws.com"
      },
      "Effect": "Allow",
      "Sid": "LambdaFunctionAssumeRolePermission",
      "Condition": {
        "StringEquals": {
          "aws:SourceArn": "${local.lambda_arn}"
        }
      }
    }
  ]
}
EOF
}

resource "aws_iam_role_policy_attachment" "vpc_integration" {
  count      = local.vpc_integration_count
  policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaVPCAccessExecutionRole"
  role       = aws_iam_role.iam_for_lambda.name
}

resource "aws_iam_role_policy_attachment" "policy_attachment" {
  role       = aws_iam_role.iam_for_lambda.name
  policy_arn = aws_iam_policy.lambda_policy.arn
}

resource "aws_iam_role_policy_attachment" "custom_policies" {
  count      = length(var.custom_policies)
  policy_arn = var.custom_policies[count.index]
  role       = aws_iam_role.iam_for_lambda.name
}

resource "time_sleep" "wait_1_minute" {
  depends_on = [
    aws_iam_role_policy_attachment.custom_policies,
    aws_iam_role_policy_attachment.policy_attachment,
    aws_iam_role_policy_attachment.vpc_integration
  ]
  create_duration = "1m"

  lifecycle {
    ignore_changes = all
  }
}

resource "aws_lambda_function" "lambda" {
  depends_on = [
    aws_cloudwatch_log_group.lambda_log_group,
    time_sleep.wait_1_minute
  ]
  ...
  role          = aws_iam_role.iam_for_lambda.arn
  ...

 dynamic "vpc_config" {
    for_each = var.vpc_integration == null ? [] : [1]
    content {
      security_group_ids = concat(
        var.vpc_integration.sg_ids,
        values(aws_security_group.lambda)[*].id
      )
      subnet_ids = var.vpc_integration.subnet_ids
    }
  }
}
```

and when I run the job I get below plan 

```
  # module.rds-mysql.module.backup-lambda["diamant"].aws_lambda_function.lambda is tainted, so must be replaced
-/+ resource "aws_lambda_function" "lambda" {
      ~ architectures                  = [
          - "x86_64",
        ] -> (known after apply)
      ~ arn                            = "arn:aws:lambda:eu-west-1:xxxxxxxxxxxx:function:example-eu-west-1" -> (known after apply)
      ~ id                             = "example-eu-west-1" -> (known after apply)
      ~ invoke_arn                     = "arn:aws:apigateway:eu-west-1:lambda:path/xxxx/functions/arn:aws:lambda:eu-west-1:xxxxxxxxxxxxxxx:function:example-eu-west-1" -> (known after apply)
      ~ last_modified                  = "2024-05-03T14:45:50.633+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-1:xxxxxxxx:function:example-lambda:$LATEST" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:eu-west-1:lambda:path/2015-03-31/functions/arn:aws:lambda:eu-west-1:xxxxxxxxxxxxxxx:function:example-eu-west-1:$LATEST/invocations" -> (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      ~ source_code_size               = 814 -> (known after apply)

      ~ version                        = "$LATEST" -> (known after apply)
        # (16 unchanged attributes hidden)

      ~ ephemeral_storage {
          ~ size = 512 -> (known after apply)
        }

      ~ logging_config {
          + application_log_level = (known after apply)
          ~ log_format            = "Text" -> (known after apply)
          ~ log_group             = "/aws/lambda/exmaple-lmabda" -> (known after apply)
          + system_log_level      = (known after apply)
        }

      ~ tracing_config {
          ~ mode = "PassThrough" -> (known after apply)
        }

      ~ vpc_config {
          ~ vpc_id                      = "vpc-xxxxxxxxxxxxxxxx" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.rds-mysql.module.backup-lambda["exmaple"].aws_lambda_permission.allow_cloudwatch_to_call_check_foo[0] will be created
  + resource "aws_lambda_permission" "allow_cloudwatch_to_call_check_foo" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "exmaple-function"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = "arn:aws:events:eu-west-1:XXXXXXXX:rule/exmaple-eu-west-1"
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # module.rds-mysql.module.backup-lambda["exmaple"].time_sleep.wait_1_minute will be created
  + resource "time_sleep" "wait_1_minute" {
      + create_duration = "1m"
      + id              = (known after apply)
    }

```

and TF apply output

```
module.rds-mysql.module.backup-lambda["example"].aws_lambda_function.lambda: Destroying... [id=example]
module.rds-mysql.module.backup-lambda["omaccounts"].time_sleep.wait_1_minute: Creating...
module.rds-mysql.module.backup-lambda["omaccounts"].time_sleep.wait_1_minute: Still creating... [10s elapsed]
module.rds-mysql.module.backup-lambda["omaccounts"].time_sleep.wait_1_minute: Still creating... [20s elapsed]
module.rds-mysql.module.backup-lambda["omaccounts"].time_sleep.wait_1_minute: Still creating... [30s elapsed]
module.rds-mysql.module.backup-lambda["omaccounts"].time_sleep.wait_1_minute: Still creating... [40s elapsed]
module.rds-mysql.module.backup-lambda["omaccounts"].time_sleep.wait_1_minute: Still creating... [50s elapsed]
module.rds-mysql.module.backup-lambda["omaccounts"].time_sleep.wait_1_minute: Still creating... [1m0s elapsed]
module.rds-mysql.module.backup-lambda["omaccounts"].time_sleep.wait_1_minute: Creation complete after 1m0s [id=2024-05-03T15:03:07Z]
module.rds-mysql.module.backup-lambda["example"].aws_lambda_function.lambda: Creating...
╵
╷
│ Error: creating Lambda Function (example-lmabda): waiting for completion: unexpected state 'Failed', wanted target 'Active'. last error: InsufficientRolePermissions: The function's execution role doesn't have permission to perform this operation.
│ 
│   with module.rds-mysql.module.backup-lambda["examle"].aws_lambda_function.lambda,
│   on .terraform/modules/rds-mysql/lambda/main.tf line 20, in resource "aws_lambda_function" "lambda":
│   20: resource "aws_lambda_function" "lambda" {
│
```

FYI: only the lambda is getting re-created, IAM role and attachment are not getting re-created and I tried with deleting lambda and IAM role with depends on without the time_sleep and kept getting same error.

Before deleting lambda I used to get same error for not enough permission for lambda to add vpc config.